AndEmi81/indesit_inertia_rx210/HAL/RN_300H_39079/RN_300H_39079_reg.h
/***********************************************************************/
/*                                                                     */
/*  FILE        :iodefine.h                                            */
/*  DATE        :Tue, Aug 14, 2007                                     */
/*  DESCRIPTION :Definition of I/O Register                            */
/*  CPU TYPE    :H8/36079                                              */
/*                                                                     */
/*  This file is generated by Renesas Project Generator (Ver.4.8).     */
/*                                                                     */
/***********************************************************************/
#ifndef _300H_39079_H	//added
#define _300H_39079_H   //added

typedef unsigned char 			byte;

#pragma bit_order left
/************************************************************************/
/*      H8/36079 Series Include File                         Ver 2.1    */
/************************************************************************/
struct st_tz0 {                                         /* struct TZ0   */
              union {                                   /* TCR          */
                    unsigned char BYTE;                 /*  Byte Access */
                    struct {                            /*  Bit  Access */
                           unsigned char CCLR:3;        /*    CCLR      */
                           unsigned char CKEG:2;        /*    CKEG      */
                           unsigned char TPSC:3;        /*    TPSC      */
                           }      BIT;                  /*              */
                    }           TCR;                    /*              */
              union {                                   /* TIORA        */
                    unsigned char BYTE;                 /*  Byte Access */
                    struct {                            /*  Bit  Access */
                           unsigned char    :1;         /*              */
                           unsigned char IOB:3;         /*    IOB       */
                           unsigned char    :1;         /*              */
                           unsigned char IOA:3;         /*    IOA       */
                           }      BIT;                  /*              */
                    }           TIORA;                  /*              */
              union {                                   /* TIORC        */
                    unsigned char BYTE;                 /*  Byte Access */
                    struct {                            /*  Bit  Access */
                           unsigned char    :1;         /*              */
                           unsigned char IOD:3;         /*    IOD       */
                           unsigned char    :1;         /*              */
                           unsigned char IOC:3;         /*    IOC       */
                           }      BIT;                  /*              */
                    }           TIORC;                  /*              */
              union {                                   /* TSR          */
                    unsigned char BYTE;                 /*  Byte Access */
                    struct {                            /*  Bit  Access */
                           unsigned char     :3;        /*              */
                           unsigned char OVF :1;        /*    OVF       */
                           unsigned char IMFD:1;        /*    IMFD      */
                           unsigned char IMFC:1;        /*    IMFC      */
                           unsigned char IMFB:1;        /*    IMFB      */
                           unsigned char IMFA:1;        /*    IMFA      */
                           }      BIT;                  /*              */
                    }           TSR;                    /*              */
              union {                                   /* TIER         */
                    unsigned char BYTE;                 /*  Byte Access */
                    struct {                            /*  Bit  Access */
                           unsigned char      :3;       /*              */
                           unsigned char OVIE :1;       /*    OVIE      */
                           unsigned char IMIED:1;       /*    IMIED     */
                           unsigned char IMIEC:1;       /*    IMIEC     */
                           unsigned char IMIEB:1;       /*    IMIEB     */
                           unsigned char IMIEA:1;       /*    IMIEA     */
                           }      BIT;                  /*              */
                    }           TIER;                   /*              */
              union {                                   /* POCR         */
                    unsigned char BYTE;                 /*  Byte Access */
                    struct {                            /*  Bit  Access */
                           unsigned char     :5;        /*              */
                           unsigned char POLD:1;        /*    POLD      */
                           unsigned char POLC:1;        /*    POLC      */
                           unsigned char POLB:1;        /*    POLB      */
                           }      BIT;                  /*              */
                    }           POCR;                   /*              */
              unsigned int      TCNT;                   /* TCNT         */
              unsigned int      GRA;                    /* GRA          */
              unsigned int      GRB;                    /* GRB          */
              unsigned int      GRC;                    /* GRC          */
              unsigned int      GRD;                    /* GRD          */
};                                                      /*              */
struct st_tz1 {                                         /* struct TZ1   */
              union {                                   /* TCR          */
                    unsigned char BYTE;                 /*  Byte Access */
                    struct {                            /*  Bit  Access */
                           unsigned char CCLR:3;        /*    CCLR      */
                           unsigned char CKEG:2;        /*    CKEG      */
                           unsigned char TPSC:3;        /*    TPSC      */
                           }      BIT;                  /*              */
                    }           TCR;                    /*              */
              union {                                   /* TIORA        */
                    unsigned char BYTE;                 /*  Byte Access */
                    struct {                            /*  Bit  Access */
                           unsigned char    :1;         /*              */
                           unsigned char IOB:3;         /*    IOB       */
                           unsigned char    :1;         /*              */
                           unsigned char IOA:3;         /*    IOA       */
                           }      BIT;                  /*              */
                    }           TIORA;                  /*              */
              union {                                   /* TIORC        */
                    unsigned char BYTE;                 /*  Byte Access */
                    struct {                            /*  Bit  Access */
                           unsigned char    :1;         /*              */
                           unsigned char IOD:3;         /*    IOD       */
                           unsigned char    :1;         /*              */
                           unsigned char IOC:3;         /*    IOC       */
                           }      BIT;                  /*              */
                    }           TIORC;                  /*              */
              union {                                   /* TSR          */
                    unsigned char BYTE;                 /*  Byte Access */
                    struct {                            /*  Bit  Access */
                           unsigned char     :2;        /*              */
                           unsigned char UDF :1;        /*    UDF       */
                           unsigned char OVF :1;        /*    OVF       */
                           unsigned char IMFD:1;        /*    IMFD      */
                           unsigned char IMFC:1;        /*    IMFC      */
                           unsigned char IMFB:1;        /*    IMFB      */
                           unsigned char IMFA:1;        /*    IMFA      */
                           }      BIT;                  /*              */
                    }           TSR;                    /*              */
              union {                                   /* TIER         */
                    unsigned char BYTE;                 /*  Byte Access */
                    struct {                            /*  Bit  Access */
                           unsigned char      :3;       /*              */
                           unsigned char OVIE :1;       /*    OVIE      */
                           unsigned char IMIED:1;       /*    IMIED     */
                           unsigned char IMIEC:1;       /*    IMIEC     */
                           unsigned char IMIEB:1;       /*    IMIEB     */
                           unsigned char IMIEA:1;       /*    IMIEA     */
                           }      BIT;                  /*              */
                    }           TIER;                   /*              */
              union {                                   /* TOCR         */
                    unsigned char BYTE;                 /*  Byte Access */
                    struct {                            /*  Bit  Access */
                           unsigned char     :5;        /*              */
                           unsigned char POLD:1;        /*    POLD      */
                           unsigned char POLC:1;        /*    POLC      */
                           unsigned char POLB:1;        /*    POLB      */
                           }      BIT;                  /*              */
                    }           POCR;                   /*              */
              unsigned int      TCNT;                   /* TCNT         */
              unsigned int      GRA;                    /* GRA          */
              unsigned int      GRB;                    /* GRB          */
              unsigned int      GRC;                    /* GRC          */
              unsigned int      GRD;                    /* GRD          */
};                                                      /*              */
struct st_tz {                                          /* struct TZ    */
             union {                                    /* TSTR         */
                   unsigned char BYTE;                  /*  Byte Access */
                   struct {                             /*  Bit  Access */
                          unsigned char     :6;         /*              */
                          unsigned char STR1:1;         /*    STR1      */
                          unsigned char STR0:1;         /*    STR0      */
                          }      BIT;                   /*              */
                   }            TSTR;                   /*              */
             union {                                    /* TMDR         */
                   unsigned char BYTE;                  /*  Byte Access */
                   struct {                             /*  Bit  Access */
                          unsigned char BFD1:1;         /*    BFD1      */
                          unsigned char BFC1:1;         /*    BFC1      */
                          unsigned char BFD0:1;         /*    BFD0      */
                          unsigned char BFC0:1;         /*    BFC0      */
                          unsigned char     :3;         /*              */
                          unsigned char SYNC:1;         /*    SYNC      */
                          }      BIT;                   /*              */
                   }            TMDR;                   /*              */
             union {                                    /* TPMR         */
                   unsigned char BYTE;                  /*  Byte Access */
                   struct {                             /*  Bit  Access */
                          unsigned char      :1;        /*              */
                          unsigned char PWMD1:1;        /*    PWMD1     */
                          unsigned char PWMC1:1;        /*    PWMC1     */
                          unsigned char PWMB1:1;        /*    PWMB1     */
                          unsigned char      :1;        /*              */
                          unsigned char PWMD0:1;        /*    PWMD0     */
                          unsigned char PWMC0:1;        /*    PWMC0     */
                          unsigned char PWMB0:1;        /*    PWMB0     */
                          }      BIT;                   /*              */
                   }            TPMR;                   /*              */
             union {                                    /* TFCR         */
                   unsigned char BYTE;                  /*  Byte Access */
                   struct {                             /*  Bit  Access */
                          unsigned char      :1;        /*              */
                          unsigned char STCLK:1;        /*    STCLK     */
                          unsigned char ADEG :1;        /*    ADEG      */
                          unsigned char ADTRG:1;        /*    ADTRG     */
                          unsigned char OLS1 :1;        /*    OLS1      */
                          unsigned char OLS0 :1;        /*    OLS0      */
                          unsigned char CMD  :2;        /*    CMD       */
                          }      BIT;                   /*              */
                   }            TFCR;                   /*              */
             union {                                    /* TOER         */
                   unsigned char BYTE;                  /*  Byte Access */
                   struct {                             /*  Bit  Access */
                          unsigned char ED1:1;          /*    ED1       */
                          unsigned char EC1:1;          /*    EC1       */
                          unsigned char EB1:1;          /*    EB1       */
                          unsigned char EA1:1;          /*    EA1       */
                          unsigned char ED0:1;          /*    ED0       */
                          unsigned char EC0:1;          /*    EC0       */
                          unsigned char EB0:1;          /*    EB0       */
                          unsigned char EA0:1;          /*    EA0       */
                          }      BIT;                   /*              */
                   }            TOER;                   /*              */
             union {                                    /* TOCR         */
                   unsigned char BYTE;                  /*  Byte Access */
                   struct {                             /*  Bit  Access */
                          unsigned char TOD1:1;         /*    TOD1      */
                          unsigned char TOC1:1;         /*    TOC1      */
                          unsigned char TOB1:1;         /*    TOB1      */
                          unsigned char TOA1:1;         /*    TOA1      */
                          unsigned char TOD0:1;         /*    TOD0      */
                          unsigned char TOC0:1;         /*    TOC0      */
                          unsigned char TOB0:1;         /*    TOB0      */
                          unsigned char TOA0:1;         /*    TOA0      */
                          }      BIT;                   /*              */
                   }            TOCR;                   /*              */
};                                                      /*              */
struct st_rtc {                                         /* struct RTC   */
              union {                                   /* RSECDR       */
                    unsigned char BYTE;                 /*  Byte Access */
                    struct {                            /*  Bit  Access */
                           unsigned char BSY:1;         /*    BSY       */
                           unsigned char SC1:3;         /*    SC1       */
                           unsigned char SC0:4;         /*    SC0       */
                           }      BIT;                  /*              */
                    }           RSECDR;                 /*              */
              union {                                   /* RMINDR       */
                    unsigned char BYTE;                 /*  Byte Access */
                    struct {                            /*  Bit  Access */
                           unsigned char BSY:1;         /*    BSY       */
                           unsigned char MN1:3;         /*    MN1       */
                           unsigned char MN0:4;         /*    MN0       */
                           }      BIT;                  /*              */
                    }           RMINDR;                 /*              */
              union {                                   /* RHRDR        */
                    unsigned char BYTE;                 /*  Byte Access */
                    struct {                            /*  Bit  Access */
                           unsigned char BSY:1;         /*    BSY       */
                           unsigned char    :1;         /*              */
                           unsigned char HR1:2;         /*    HR1       */
                           unsigned char HR0:4;         /*    HR0       */
                           }      BIT;                  /*              */
                    }           RHRDR;                  /*              */
              union {                                   /* RWKDR        */
                    unsigned char BYTE;                 /*  Byte Access */
                    struct {                            /*  Bit  Access */
                           unsigned char BSY:1;         /*    BSY       */
                           unsigned char    :3;         /*              */
                           unsigned char WK :4;         /*    WK        */
                           }      BIT;                  /*              */
                    }           RWKDR;                  /*              */
              union {                                   /* RTCCR1       */
                    unsigned char BYTE;                 /*  Byte Access */
                    struct {                            /*  Bit  Access */
                           unsigned char RUN:1;         /*    RUN       */
                           unsigned char MD :1;         /*    MD        */
                           unsigned char PM :1;         /*    PM        */
                           unsigned char RST:1;         /*    RST       */
                           }      BIT;                  /*              */
                    }           RTCCR1;                 /*              */
              union {                                   /* RTCCR2       */
                    unsigned char BYTE;                 /*  Byte Access */
                    struct {                            /*  Bit  Access */
                           unsigned char     :2;        /*              */
                           unsigned char FOIE:1;        /*    FOIE      */
                           unsigned char WKIE:1;        /*    WKIE      */
                           unsigned char DYIE:1;        /*    DYIE      */
                           unsigned char HRIE:1;        /*    HRIE      */
                           unsigned char MNIE:1;        /*    MNIE      */
                           unsigned char SEIE:1;        /*    SEIE      */
                           }      BIT;                  /*              */
                    }           RTCCR2;                 /*              */
              char              wk;                     /*              */
              union {                                   /* RTCCSR       */
                    unsigned char BYTE;                 /*  Byte Access */
                    struct {                            /*  Bit  Access */
                           unsigned char     :1;        /*              */
                           unsigned char CKSO:2;        /*    CKSO      */
                           unsigned char     :1;        /*              */
                           unsigned char CKSI:4;        /*    CKSI      */
                           }      BIT;                  /*              */
                    }           RTCCSR;                 /*              */
};                                                      /*              */
struct st_lvd {                                         /* struct LVD   */
              union {                                   /* LVDCR        */
                    unsigned char BYTE;                 /*  Byte Access */
                    struct {                            /*  Bit  Access */
                           unsigned char       :2;      /*              */
                           unsigned char VDDII :1;      /*    VDDII     */
                           unsigned char       :1;      /*              */
                           unsigned char LVDSEL:1;      /*    LVDSEL    */
                           unsigned char       :1;      /*              */
                           unsigned char LVDDE :1;      /*    LVDDE     */
                           unsigned char LVDUE :1;      /*    LVDUE     */
                           }      BIT;                  /*              */
                    }           CR;                     /*              */
              union {                                   /* LVDSR        */
                    unsigned char BYTE;                 /*  Byte Access */
                    struct {                            /*  Bit  Access */
                           unsigned char      :6;       /*              */
                           unsigned char LVDDF:1;       /*    LVDDF     */
                           unsigned char LVDUF:1;       /*    LVDUF     */
                           }      BIT;                  /*              */
                    }           SR;                     /*              */
              union {                                   /* LVDRF        */
                    unsigned char BYTE;                 /*  Byte Access */
                    struct {                            /*  Bit  Access */
                           unsigned char     :6;        /*              */
                           unsigned char RRST:1;        /*    RRST      */
                           unsigned char WRST:1;        /*    WRST      */
                           }      BIT;                  /*              */
                    }           RF;                     /*              */
};                                                      /*              */
