AndEmi81/indesit_inertia_rx210/HAL/RN_300H_39079/RN_300H_39079_reg.h
#if defined(PLATFORM2_SUPPORT)
#pragma bit_order right
#endif
#define TZ0     (*(volatile struct st_tz0   *)0xFFF700) /* TZ0   Address*/
#define TZ1     (*(volatile struct st_tz1   *)0xFFF710) /* TZ1   Address*/
#define TZ      (*(volatile struct st_tz    *)0xFFF720) /* TZ    Address*/
#define RTC     (*(volatile struct st_rtc   *)0xFFF728) /* RTC   Address*/
#define LVD     (*(volatile struct st_lvd   *)0xFFF730) /* LVD   Address*/
#define OSCI    (*(volatile struct st_osci  *)0xFFF735) /* OSCI  Address*/
#define SCI3_2  (*(volatile struct st_sci3  *)0xFFF740) /* SCI3_2Address*/
#define IIC2    (*(volatile struct st_iic2  *)0xFFF748) /* IIC2  Address*/
#define TB1     (*(volatile struct st_tb1   *)0xFFF760) /* TB1   Address*/
#define FLASH   (*(volatile struct st_flash *)0xFFFF90) /* FLASH Address*/
#define TV      (*(volatile struct st_tv    *)0xFFFFA0) /* TV    Address*/
#define SCI3    (*(volatile struct st_sci3  *)0xFFFFA8) /* SCI3  Address*/
#define AD      (*(volatile struct st_ad    *)0xFFFFB0) /* A/D   Address*/
#define PWM     (*(volatile struct st_pwm   *)0xFFFFBC) /* PWM   Address*/
#define WDT     (*(volatile struct st_wdt   *)0xFFFFC0) /* WDT   Address*/
#define ABRK    (*(volatile struct st_abrk  *)0xFFFFC8) /* ABRK  Address*/
#define IO      (*(volatile struct st_io    *)0xFFFFD0) /* IO    Address*/
#define SYSCR1  (*(volatile union  un_syscr1*)0xFFFFF0) /* SYSCR1Address*/
#define SYSCR2  (*(volatile union  un_syscr2*)0xFFFFF1) /* SYSCR2Address*/
#define IEGR1   (*(volatile union  un_iegr1 *)0xFFFFF2) /* IEGR1 Address*/
#define IEGR2   (*(volatile union  un_iegr2 *)0xFFFFF3) /* IEGR2 Address*/
#define IENR1   (*(volatile union  un_ienr1 *)0xFFFFF4) /* IENR1 Address*/
#define IENR2   (*(volatile union  un_ienr2 *)0xFFFFF5) /* IENR2 Address*/
#define IRR1    (*(volatile union  un_irr1  *)0xFFFFF6) /* IRR1  Address*/
#define IRR2    (*(volatile union  un_irr2  *)0xFFFFF7) /* IRR2  Address*/
#define IWPR    (*(volatile union  un_iwpr  *)0xFFFFF8) /* IWPR  Address*/
#define MSTCR1  (*(volatile union  un_mstcr1*)0xFFFFF9) /* MSTCR1Address*/
#define MSTCR2  (*(volatile union  un_mstcr2*)0xFFFFFA) /* MSTCR2Address*/
#define CKCSR   (*(volatile union  un_ckcsr *)0xFFF734) /* CKCSR Address*/
#define TLB1    TCB1                            /* Change TLB1 --> TCB1 */

/* Added Stefano Ughi */
/* Port Data Register 1 */
#define PDR1_PIN7_MASK   0x80
#define PDR1_PIN6_MASK   0x40
#define PDR1_PIN5_MASK   0x20
#define PDR1_PIN4_MASK   0x10
//#define PDR1_PIN3_MASK   0x08
#define PDR1_PIN2_MASK   0x04
#define PDR1_PIN1_MASK   0x02
#define PDR1_PIN0_MASK   0x01

/* Port Data Register 2 */
//#define PDR2_PIN7_MASK   0x80
//#define PDR2_PIN6_MASK   0x40
//#define PDR2_PIN5_MASK   0x20
#define PDR2_PIN4_MASK   0x10
#define PDR2_PIN3_MASK   0x08
#define PDR2_PIN2_MASK   0x04
#define PDR2_PIN1_MASK   0x02
#define PDR2_PIN0_MASK   0x01

/* Port Data Register 3 */

#define PDR3_PIN7_MASK   0x80
#define PDR3_PIN6_MASK   0x40
#define PDR3_PIN5_MASK   0x20
#define PDR3_PIN4_MASK   0x10
#define PDR3_PIN3_MASK   0x08
#define PDR3_PIN2_MASK   0x04
#define PDR3_PIN1_MASK   0x02
#define PDR3_PIN0_MASK   0x01

/* Port Data Register 4 */
//#define PDR4_PIN7_MASK   0x80
//#define PDR4_PIN6_MASK   0x40
//#define PDR4_PIN5_MASK   0x20
//#define PDR4_PIN4_MASK   0x10
//#define PDR4_PIN3_MASK   0x08
//#define PDR4_PIN2_MASK   0x04
//#define PDR4_PIN1_MASK   0x02
//#define PDR4_PIN0_MASK   0x01

/* Port Data Register 5 */
#define PDR5_PIN7_MASK   0x80
#define PDR5_PIN6_MASK   0x40
#define PDR5_PIN5_MASK   0x20
#define PDR5_PIN4_MASK   0x10
#define PDR5_PIN3_MASK   0x08
#define PDR5_PIN2_MASK   0x04
#define PDR5_PIN1_MASK   0x02
#define PDR5_PIN0_MASK   0x01

/* Port Data Register 6 */
#define PDR6_PIN7_MASK   0x80
#define PDR6_PIN6_MASK   0x40
#define PDR6_PIN5_MASK   0x20
#define PDR6_PIN4_MASK   0x10
#define PDR6_PIN3_MASK   0x08
#define PDR6_PIN2_MASK   0x04
#define PDR6_PIN1_MASK   0x02
#define PDR6_PIN0_MASK   0x01

/* Port Data Register 7 */
//#define PDR7_PIN7_MASK   0x80
#define PDR7_PIN6_MASK   0x40
#define PDR7_PIN5_MASK   0x20
#define PDR7_PIN4_MASK   0x10
//#define PDR7_PIN3_MASK   0x08
#define PDR7_PIN2_MASK   0x04
#define PDR7_PIN1_MASK   0x02
#define PDR7_PIN0_MASK   0x01

/* Port Data Register 8 */
#define PDR8_PIN7_MASK   0x80
#define PDR8_PIN6_MASK   0x40
#define PDR8_PIN5_MASK   0x20
//#define PDR8_PIN4_MASK   0x10
//#define PDR8_PIN3_MASK   0x08
//#define PDR8_PIN2_MASK   0x04
//#define PDR8_PIN1_MASK   0x02
//#define PDR8_PIN0_MASK   0x01

/* Port Data Register B */
#define PDRB_PIN7_MASK   0x80
#define PDRB_PIN6_MASK   0x40
#define PDRB_PIN5_MASK   0x20
#define PDRB_PIN4_MASK   0x10
#define PDRB_PIN3_MASK   0x08
#define PDRB_PIN2_MASK   0x04
#define PDRB_PIN1_MASK   0x02
#define PDRB_PIN0_MASK   0x01

/* Port Data Register C */
//#define PDRC_PIN7_MASK   0x80
//#define PDRC_PIN6_MASK   0x40
//#define PDRC_PIN5_MASK   0x20
//#define PDRC_PIN4_MASK   0x10
//#define PDRC_PIN3_MASK   0x08
//#define PDRC_PIN2_MASK   0x04
#define PDRC_PIN1_MASK   0x02
#define PDRC_PIN0_MASK   0x01

#endif /* #ifndef _300H_39079_H */

